Installer/TInF-Installer/packages/nheri.simcenter.tinf/data/Examples/windAroundSquarePrism/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication $(getApplication)

#------------------------------------------------------------------------------
